#+TITLE: endpoints
*** apisnoop v2
#+BEGIN_SRC shell
curl https://storage.googleapis.com/apisnoop/dev/ci-kubernetes-e2e-gci-gce/1165794879855398916/endpoints.json \
 | jq . | gron | grep testHits | grep -v testHits\ \=\ 0 | wc -l
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
226
#+end_EXAMPLE
*** apisnoop v2
#+BEGIN_SRC shell
curl https://storage.googleapis.com/apisnoop/dev/ci-kubernetes-e2e-gci-gce/1165794879855398916/endpoints.json \
 | jq . | gron | grep conformanceHits | grep -v conformanceHits\ \=\ 0 | wc -l
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
133
#+end_EXAMPLE

